

export const startLocationData = [
    {
        id: 1,
        text: "Аэропорт Анталия",
        value: "Аэропорт Анталия",
    },

    {
        id: 2,
        text: "Аэропорт Даламан",
        value: "Аэропорт Даламан",
    },

    {
        id: 3,
        text: "Даламан (город)",
        value: "Даламан (город)",
    },

    {
        id: 4,
        text: "Каш (город)",
        value: "Каш (город)",
    },

    {
        id: 5,
        text: "Анталия (город)",
        value: "Анталия (город)",
    },
]

export const endLocationData = [
    {
        id: 1,
        text: "Каш (город)",
        value: "Каш (город)",
    },
    {
        id: 2,
        text: "Аэропорт Анталия",
        value: "Аэропорт Анталия",
    },
    {
        id: 3,
        text: "Анталия (город)",
        value: "Анталия (город)",
    },

    {
        id: 4,
        text: "Аэропорт Даламан",
        value: "Аэропорт Даламан",
    },

    {
        id: 5,
        text: "Даламан (город)",
        value: "Даламан (город)",
    },
]