export const FAQ = [
    {
        question: "Уведомления / пуши о новых попутчиках",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Личная информация / согласие на обработку",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Смена времени / даты/ города / адреса",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Другие вопросы по поездке",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Экстренная ситуация",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Отмена поездки",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Оплата поездки",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Рейс задерживается",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Опаздываю ко времени",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Не нашлись попутчики",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Может ли поменяться цена на поездку?",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Сколько времени мы будем в дороге",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "С животными можно?",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    },
    {
        question: "Поездка с детьми",
        answer: "Текст с ответом на частые вопросы о поездке. Несколько строк текста."
    }, 
]